Catalogs/стомОбластиСегментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>стомОбластиСегментов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Декоративная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обозначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбласти</Name>
					<Type>
						<v8:Type>cfg:EnumRef.стомВидыОбластей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкцияРодитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомОбластиСегментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоКонструкции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомОбластиСегментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерединаКонструкции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомОбластиСегментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецКонструкции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомОбластиСегментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокСостояний</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомСостоянияЗубов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.стомПараметрыЗубнойФормулы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ChartsOfCharacteristicTypes/стомПараметрыЗубнойФормулы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>стомПараметрыЗубнойФормулы</Name>
			<Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>cfg:CatalogRef.ДополнительныеЗначенияХарактеристик</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>14</v8:Digits>
					<v8:FractionDigits>4</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>1024</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>Date</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МинимальноеЗначение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальноеЗначение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регулирование</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретРучногоРедактирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматРедактирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматПредставления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазворачиватьПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.стомПараметрыЗубнойФормулы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеЗначенийПараметров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

CommonModules/стомПараметрыЗубов/Ext/Module.bsl
// Функция - Сформировать параметры зубной формулы таблицей HTML
//
// Параметры:
//  Клиент					 - СправочникСсылка.Клиенты - Клиент приема
//  ЗубнаяКарта				 - СправочникСсылка.стомВидыЗубныхКарт - Зубная карта клиента
//  Прием					 - ДокументСсылка.Прием - Ссылка на прием
//  ОтборПоГруппеПараметров	 - ПланВидовХарактеристикСсылка.стомПараметрыЗубнойФормулы - Если указан, будут выведены значения параметров только по указанной группе
//  Оформление				 - Структура - Если не заполнено, будет использоваться оформление по умолчанию, возможные элементы структуры:
//							 			 - АтрибутыЗаголовкаТаблицы
//										 - АтрибутыСтрокОбозначения
//										 - АтрибутыСтрокГруппПараметров
//										 - АтрибутыСтрокПараметров
//										 - АтрибутыТекстаРасшифровки
//										 - АтрибутыКолонкиПараметров
//										 Элементы структуры должы содержать вложенную структуру со списком атрибутов (width, style и т.д.) тегов HTML, задающих оформление
// 
// Возвращаемое значение:
// Строка - HTML-текст для вставки
//
Функция СформироватьПараметрыЗубнойФормулыТаблицейHTML(Клиент, ЗубнаяКарта, Прием, ОтборПоГруппеПараметров = Неопределено, Оформление = Неопределено) Экспорт 
	
	ПараметрыЗК = стомСтоматология.ПолучитьПараметрыЗубнойФормулыНаДату(Клиент, ЗубнаяКарта, Прием.Дата, Прием.Ссылка);
	ОбозначенияЗубов = стомСтоматология.ПолучитьОбозначенияЗубовНаДату(Клиент, ЗубнаяКарта, Прием.Дата);
	
	ТаблицаПорядок = стомСтоматология.ПолучитьТаблицуПорядкаЗубов();
	
	// Собираем список параметров
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПорядокЗубов.НаименованиеЗуба,
	|	ПорядокЗубов.Порядок
	|ПОМЕСТИТЬ ПорядокЗубов
	|ИЗ
	|	&ПорядокЗубов КАК ПорядокЗубов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	стомОбластиСегментовСписокПараметров.Ссылка КАК Область,
	|	стомОбластиСегментовСписокПараметров.Параметр.Родитель КАК ГруппаПараметров,
	|	стомОбластиСегментовСписокПараметров.Параметр
	|ПОМЕСТИТЬ ПараметрыПоОбластям
	|ИЗ
	|	Справочник.стомОбластиСегментов.СписокПараметров КАК стомОбластиСегментовСписокПараметров
	|ГДЕ
	|	(&Параметр = ЗНАЧЕНИЕ(ПланВидовХарактеристик.стомПараметрыЗубнойФормулы.ПустаяСсылка)
	|			ИЛИ стомОбластиСегментовСписокПараметров.Параметр В ИЕРАРХИИ (&Параметр))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияПараметров.ЗубВКарте,
	|	ЗначенияПараметров.СегментВЗубе,
	|	ЗначенияПараметров.Параметр,
	|	ЗначенияПараметров.Значение
	|ПОМЕСТИТЬ ЗначенияПараметров
	|ИЗ
	|	&ЗначенияПараметров КАК ЗначенияПараметров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	стомЗубыКарты.Ссылка КАК ЗубВКарте,
	|	ВЫБОР
	|		КОГДА стомЗубыКарты.Наименование ПОДОБНО ""[12]_""
	|			ТОГДА ""Верх""
	|		КОГДА стомЗубыКарты.Наименование ПОДОБНО ""[34]_""
	|			ТОГДА ""Низ""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Расположение,
	|	ПорядокЗубов.Порядок
	|ПОМЕСТИТЬ ЗубыКарты
	|ИЗ
	|	Справочник.стомЗубыКарты КАК стомЗубыКарты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПорядокЗубов КАК ПорядокЗубов
	|		ПО стомЗубыКарты.Наименование = ПорядокЗубов.НаименованиеЗуба
	|ГДЕ
	|	стомЗубыКарты.Владелец = &ЗубнаяКарта
	|	И ВЫБОР
	|			КОГДА стомЗубыКарты.Наименование ПОДОБНО ""[12]_""
	|				ТОГДА ""Верх""
	|			КОГДА стомЗубыКарты.Наименование ПОДОБНО ""[34]_""
	|				ТОГДА ""Низ""
	|			ИНАЧЕ """"
	|		КОНЕЦ <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗубыКарты.ЗубВКарте КАК ЗубВКарте,
	|	стомСегментыЗубов.Ссылка КАК СегментВЗубе,
	|	ПараметрыПоОбластям.Область,
	|	ПараметрыПоОбластям.ГруппаПараметров,
	|	ПараметрыПоОбластям.Параметр КАК Параметр,
	|	ЗубыКарты.Расположение,
	|	ЗубыКарты.Порядок
	|ПОМЕСТИТЬ ПараметрыПоЗубам
	|ИЗ
	|	ЗубыКарты КАК ЗубыКарты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.стомСегментыЗубов КАК стомСегментыЗубов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПараметрыПоОбластям КАК ПараметрыПоОбластям
	|			ПО стомСегментыЗубов.Сегмент.Область = ПараметрыПоОбластям.Область
	|		ПО (стомСегментыЗубов.Владелец = &ЗубнаяКарта
	|				ИЛИ ЗубыКарты.ЗубВКарте.Зуб = стомСегментыЗубов.Владелец)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗубыКарты.ЗубВКарте,
	|	ЗубыКарты.Расположение КАК Расположение
	|ИЗ
	|	ЗубыКарты КАК ЗубыКарты
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗубыКарты.Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыПоЗубам.ГруппаПараметров КАК ГруппаПараметров,
	|	ПараметрыПоЗубам.Параметр КАК Параметр,
	|	ПараметрыПоЗубам.ЗубВКарте КАК ЗубВКарте,
	|	ПараметрыПоЗубам.Область,
	|	ПараметрыПоЗубам.СегментВЗубе,
	|	ЗначенияПараметров.Значение,
	|	ПараметрыПоЗубам.Расположение КАК Расположение
	|ИЗ
	|	ПараметрыПоЗубам КАК ПараметрыПоЗубам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияПараметров КАК ЗначенияПараметров
	|		ПО ПараметрыПоЗубам.ЗубВКарте = ЗначенияПараметров.ЗубВКарте
	|			И ПараметрыПоЗубам.СегментВЗубе = ЗначенияПараметров.СегментВЗубе
	|			И ПараметрыПоЗубам.Параметр = ЗначенияПараметров.Параметр
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПараметрыПоЗубам.Порядок
	|ИТОГИ ПО
	|	ГруппаПараметров,
	|	Параметр,
	|	Расположение,
	|	ЗубВКарте";
	Запрос.УстановитьПараметр("ПорядокЗубов", ТаблицаПорядок);
	Запрос.УстановитьПараметр("ЗначенияПараметров", ПараметрыЗК);
	Запрос.УстановитьПараметр("ЗубнаяКарта", ЗубнаяКарта);
	Запрос.УстановитьПараметр("Параметр", ?(ЗначениеЗаполнено(ОтборПоГруппеПараметров), ОтборПоГруппеПараметров, ПланыВидовХарактеристик.стомПараметрыЗубнойФормулы.ПустаяСсылка()));
	
	Результат = Запрос.ВыполнитьПакет();
	
	ПараметрыОформления = ПолучитьОформлениеПоУмолчаниюДляТаблицЗубнойФормулы(Оформление);
		
	ДокументHTML = РаботаСDOMКлиентСервер.СоздатьДокументDOM("");
	
	КорневойЭлемент = РаботаСDOMКлиентСервер.СоздатьЭлементDOM(ДокументHTML, "DIV", ДокументHTML);
	
	Таблица = РаботаСDOMКлиентСервер.СоздатьЭлементDOM(ДокументHTML, "TABLE", КорневойЭлемент);
	
	Если ЗначениеЗаполнено(ОтборПоГруппеПараметров) Тогда 
		ЗаголовокТаблицы = РаботаСDOMКлиентСервер.СоздатьЭлементDOM(ДокументHTML, "CAPTION", Таблица);
		ТекстЗаголовка = РаботаСDOMКлиентСервер.СоздатьТекстовыйЭлементDOM(ДокументHTML, ОтборПоГруппеПараметров, ЗаголовокТаблицы, , ПараметрыОформления.АтрибутыЗаголовкаТаблицы);
	КонецЕсли;
	
	СтрокиНаДобавление = Новый Структура("Верх, Низ", Новый Массив, Новый Массив);
	
	// Выводим обозначения
	СтрокиОбозначенияЗубов = Новый Структура("Верх, Низ", 
		РаботаСDOMКлиентСервер.СоздатьЭлементDOM(ДокументHTML, "TR", , , ПараметрыОформления.АтрибутыСтрокОбозначения), 
		РаботаСDOMКлиентСервер.СоздатьЭлементDOM(ДокументHTML, "TR", , , ПараметрыОформления.АтрибутыСтрокОбозначения));
		
	// Колонки обозначения челюсти
	КолонкаПараметр = РаботаСDOMКлиентСервер.СоздатьЭлементDOM(ДокументHTML, "TD", СтрокиОбозначенияЗубов.Верх, , ПараметрыОформления.АтрибутыКолонкиПараметров);
	ТекстКолонки = РаботаСDOMКлиентСервер.СоздатьТекстовыйЭлементDOM(ДокументHTML, "Верхняя", КолонкаПараметр);
	
	КолонкаПараметр = РаботаСDOMКлиентСервер.СоздатьЭлементDOM(ДокументHTML, "TD", СтрокиОбозначенияЗубов.Низ, , ПараметрыОформления.АтрибутыКолонкиПараметров);
	ТекстКолонки = РаботаСDOMКлиентСервер.СоздатьТекстовыйЭлементDOM(ДокументHTML, "Нижняя", КолонкаПараметр);
	
	ВыборкаЗубы = Результат[5].Выбрать();
	Пока ВыборкаЗубы.Следующий() Цикл
		
		СтрокаТаблицы = СтрокиОбозначенияЗубов[ВыборкаЗубы.Расположение];
		КолонкаТаблицы = РаботаСDOMКлиентСервер.СоздатьЭлементDOM(ДокументHTML, "TD", СтрокаТаблицы);
		ТекстКолонки = РаботаСDOMКлиентСервер.СоздатьТекстовыйЭлементDOM(ДокументHTML, ОбозначенияЗубов[ВыборкаЗубы.ЗубВКарте], КолонкаТаблицы);
			
	КонецЦикла;
	
	соотвПараметрыСОписаниями = Новый Соответствие;
	
	ВыборкаГруппыПараметров = Результат[6].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаГруппыПараметров.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(ОтборПоГруппеПараметров) Тогда
			
			// Строка верхней челюсти
			СтрокаТаблицы = РаботаСDOMКлиентСервер.СоздатьЭлементDOM(ДокументHTML, "TR", , , ПараметрыОформления.АтрибутыСтрокГруппПараметров);
			КолонкаТаблицы = РаботаСDOMКлиентСервер.СоздатьЭлементDOM(ДокументHTML, "TD", СтрокаТаблицы, , ПараметрыОформления.АтрибутыКолонкиПараметров);
			ТекстКолонки = РаботаСDOMКлиентСервер.СоздатьТекстовыйЭлементDOM(ДокументHTML, ВыборкаГруппыПараметров.ГруппаПараметров, КолонкаТаблицы);
			СтрокиНаДобавление.Верх.Добавить(СтрокаТаблицы);
			
			// Строка нижней челюсти
			СтрокаТаблицы = РаботаСDOMКлиентСервер.СоздатьЭлементDOM(ДокументHTML, "TR", , , ПараметрыОформления.АтрибутыСтрокГруппПараметров);
			КолонкаТаблицы = РаботаСDOMКлиентСервер.СоздатьЭлементDOM(ДокументHTML, "TD", СтрокаТаблицы, , ПараметрыОформления.АтрибутыКолонкиПараметров);
			ТекстКолонки = РаботаСDOMКлиентСервер.СоздатьТекстовыйЭлементDOM(ДокументHTML, ВыборкаГруппыПараметров.ГруппаПараметров, КолонкаТаблицы);
			СтрокиНаДобавление.Низ.Добавить(СтрокаТаблицы);
			
		КонецЕсли;
		
		ВыборкаПараметры = ВыборкаГруппыПараметров.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПараметры.Следующий() Цикл
			
			Если Не ПустаяСтрока(ВыборкаПараметры.Параметр.ОписаниеЗначенийПараметров) Тогда
				соотвПараметрыСОписаниями.Вставить(ВыборкаПараметры.Параметр, ВыборкаПараметры.Параметр.ОписаниеЗначенийПараметров);
			КонецЕсли;
			
			// Строка параметра
			СтруктураПараметров = Новый Структура("Верх, Низ", 
				РаботаСDOMКлиентСервер.СоздатьЭлементDOM(ДокументHTML, "TR", , , ПараметрыОформления.АтрибутыСтрокПараметров), 
				РаботаСDOMКлиентСервер.СоздатьЭлементDOM(ДокументHTML, "TR", , , ПараметрыОформления.АтрибутыСтрокПараметров));
				
			// Строка верхней челюсти	
			КолонкаТаблицы = РаботаСDOMКлиентСервер.СоздатьЭлементDOM(ДокументHTML, "TD", СтруктураПараметров.Верх, , ПараметрыОформления.АтрибутыКолонкиПараметров);
			ТекстКолонки = РаботаСDOMКлиентСервер.СоздатьТекстовыйЭлементDOM(ДокументHTML, ВыборкаПараметры.Параметр, КолонкаТаблицы);
			
			// Строка нижней челюсти
			КолонкаТаблицы = РаботаСDOMКлиентСервер.СоздатьЭлементDOM(ДокументHTML, "TD", СтруктураПараметров.Низ, , ПараметрыОформления.АтрибутыКолонкиПараметров);
			ТекстКолонки = РаботаСDOMКлиентСервер.СоздатьТекстовыйЭлементDOM(ДокументHTML, ВыборкаПараметры.Параметр, КолонкаТаблицы);
			
			ЗначениеПоУмолчанию = ВыборкаПараметры.Параметр.ТипЗначения.ПривестиЗначение(ВыборкаПараметры.Параметр.ЗначениеПоУмолчанию);
			
			ВыборкаРасположение = ВыборкаПараметры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаРасположение.Следующий() Цикл
				
				ВыборкаЗубы = ВыборкаРасположение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаЗубы.Следующий() Цикл
					
					ЗначениеПараметра = ЗначениеПоУмолчанию;
					
					ВыборкаСегменты = ВыборкаЗубы.Выбрать();
					СписокЗначенийПараметров = Новый СписокЗначений;
					Пока ВыборкаСегменты.Следующий() Цикл
						
						ЗначениеПараметра = ?(ЗначениеЗаполнено(ВыборкаСегменты.Значение), ВыборкаСегменты.Значение, ЗначениеПоУмолчанию);
						СписокЗначенийПараметров.Добавить(ЗначениеПараметра, Формат(ЗначениеПараметра, ВыборкаПараметры.Параметр.ФорматПредставления));
						
					КонецЦикла;
					
					Если СписокЗначенийПараметров.Количество() > 1 Тогда 
						ЗначениеПараметра = СписокЗначенийПараметров;
					КонецЕсли;
					
					ПредставлениеПараметра = Формат(ЗначениеПараметра, ВыборкаПараметры.Параметр.ФорматПредставления);
					Если ПустаяСтрока(ПредставлениеПараметра) Тогда 
						ПредставлениеПараметра = Символы.НПП;
					КонецЕсли;
					
					КолонкаТаблицы = РаботаСDOMКлиентСервер.СоздатьЭлементDOM(ДокументHTML, "TD", СтруктураПараметров[ВыборкаРасположение.Расположение]);
					ТекстКолонки = РаботаСDOMКлиентСервер.СоздатьТекстовыйЭлементDOM(ДокументHTML, ПредставлениеПараметра, КолонкаТаблицы);
			 
				КонецЦикла;
				
			КонецЦикла;
			
			СтрокиНаДобавление.Верх.Добавить(СтруктураПараметров.Верх);
			СтрокиНаДобавление.Низ.Добавить(СтруктураПараметров.Низ);
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Выводим сформированные строки таблицы
	Для Каждого СтрокаПараметра Из СтрокиНаДобавление.Верх Цикл
		Таблица.ДобавитьДочерний(СтрокаПараметра);
	КонецЦикла;
	Таблица.ДобавитьДочерний(СтрокиОбозначенияЗубов.Верх);
	Таблица.ДобавитьДочерний(СтрокиОбозначенияЗубов.Низ);
	Для Каждого СтрокаПараметра Из СтрокиНаДобавление.Низ Цикл
		Таблица.ДобавитьДочерний(СтрокаПараметра);
	КонецЦикла;
	
	// Выводим обозначения параметров
	Для Каждого кзПараметр Из соотвПараметрыСОписаниями Цикл
		
		ТекстРасшифровки = Строка(кзПараметр.Ключ) + ": " + кзПараметр.Значение;
		РаботаСDOMКлиентСервер.СоздатьТекстовыйЭлементDOM(ДокументHTML, ТекстРасшифровки, КорневойЭлемент, , ПараметрыОформления.АтрибутыТекстаРасшифровки);
		
	КонецЦикла;
	
	Результат = РаботаСDOMКлиентСервер.ПолучитьТекстHTMLДокументаDOM(ДокументHTML);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьОформлениеПоУмолчаниюДляТаблицЗубнойФормулы(ПользовательскиеАтрибуты = Неопределено) Экспорт 
	
	АтрибутыОформления = Новый Структура;
	АтрибутыОформления.Вставить("АтрибутыЗаголовкаТаблицы",		Новый Структура("align, style", "center", "font-size: 10pt; font-weight: bold"));
	АтрибутыОформления.Вставить("АтрибутыСтрокОбозначения",		Новый Структура("align, style", "center", "font-size: 10pt; font-weight: bold"));
	АтрибутыОформления.Вставить("АтрибутыСтрокГруппПараметров",	Новый Структура("align, style", "center", "font-size: 8pt; font-weight: bold"));
	АтрибутыОформления.Вставить("АтрибутыСтрокПараметров",		Новый Структура("align, style", "center", "font-size: 8pt"));
	АтрибутыОформления.Вставить("АтрибутыТекстаРасшифровки",	Новый Структура("style", "font-size: 8pt"));
	АтрибутыОформления.Вставить("АтрибутыКолонкиПараметров",	Новый Структура("width", "15%"));
	АтрибутыОформления.Вставить("АтрибутыСтрокСостоянийЗубов", 	Новый Структура("align, style", "center", "font-size: 8pt"));
	АтрибутыОформления.Вставить("АтрибутыЯчеекОсновныхВариантов", 	Новый Структура("align, style", "center", "font-size: 8pt; font-weight: bold"));
	
	Если ПользовательскиеАтрибуты <> Неопределено Тогда 
		Для Каждого кзАтрибут Из ПользовательскиеАтрибуты Цикл
			АтрибутыОформления.Вставить(кзАтрибут.Ключ, кзАтрибут.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Возврат АтрибутыОформления;
	
КонецФункции
